; domain
(define (domain openstacks)
    (:requirements :typing :action-costs)
  (:types order product count)
  (:constants n0 - count)
  (:predicates 
   (howmany-orders-not-started ?p - product ?o-count - count)
   (howmany-products-not-made ?o - order ?p-count - count)
   (required-order-not-checked ?o - order ?p - product)
   (required-product-not-checked ?o - order ?p - product)
   
   (includes ?o - order ?p - product)
   (waiting ?o - order)
   (started ?o - order)
   (shipped ?o - order)
   (made ?p - product)
   (not-made ?p - product)
   (stacks-avail ?s - count)
   (next-count ?s ?ns - count) ;; ?s + 1 = ?ns e.g. (next-count n0 n1)
   )
  
  (:action open-new-stack
           :parameters (?open ?more-open - count)
           :precondition
           (and (stacks-avail ?open)
                (next-count ?open ?more-open))
           :effect
           (and (not (stacks-avail ?open))
                (stacks-avail ?more-open)
                (increase (total-cost) 1)))

  (:action start-order
           :parameters (?o - order ?avail ?less-avail)
           :precondition (and (waiting ?o)
                              (stacks-avail ?avail)
                              (next-count ?less-avail ?avail))
           :effect (and (not (waiting ?o))
                        (started ?o)
                        (not (stacks-avail ?avail))
                        (stacks-avail ?less-avail)))

  (:action check-remaining-order
           :parameters (?o - order ?p - product
                           ?o-count ?o-less - count)
           :precondition (and (includes ?o ?p)
                              (started ?o)
                              (required-order-not-checked ?o ?p)
                              (next-count ?o-less ?o-count)
                              (howmany-orders-not-started ?p ?o-count))
                              
           :effect (and (not (howmany-orders-not-started ?p ?o-count))
                        (not (required-order-not-checked ?o ?p))
                        (howmany-orders-not-started ?p ?o-less)))

  (:action check-remaining-product
           :parameters (?o - order ?p - product
                           ?p-count ?p-less - count)
           :precondition (and (includes ?o ?p)
                              (started ?o)
                              (made ?p)
                              (required-product-not-checked ?o ?p)
                              (next-count ?p-less ?p-count)
                              (howmany-products-not-made ?o ?p-count))
                              
           :effect (and (not (howmany-products-not-made ?o ?p-count))
                        (not (required-product-not-checked ?o ?p))
                        (howmany-products-not-made ?o ?p-less)))
  
  (:action make-product
           :parameters (?p - product)
           :precondition (and (not-made ?p)
                              (howmany-orders-not-started ?p n0))
           :effect (and (not (not-made ?p))
                        (made ?p)))

  (:action ship-order
           :parameters (?avail ?more-avail - count ?o - order)
           :precondition (and (started ?o)
                              (howmany-products-not-made ?o n0)
                              (stacks-avail ?avail)
                              (next-count ?avail ?more-avail))
           :effect (and (not (started ?o))
                        (shipped ?o)
                        (not (stacks-avail ?avail))
                        (stacks-avail ?more-avail))))

; problem
(DEFINE (PROBLEM OPENSTACKS) (:DOMAIN OPENSTACKS)
 (:OBJECTS N1 N2 N3 N4 N5 N6 N7 N8 N9 N10 N11 N12 N13 N14 N15 N16 N17 N18 N19
  N20 - COUNT O0 O1 O2 O3 O4 O5 O6 O7 O8 O9 O10 O11 O12 O13 O14 O15 O16 O17 O18
  O19 - ORDER P0 P1 P2 P3 P4 P5 P6 P7 P8 P9 P10 P11 P12 P13 P14 P15 P16 P17 P18
  P19 - PRODUCT)
 (:INIT (STACKS-AVAIL N0) (NEXT-COUNT N0 N1) (NEXT-COUNT N1 N2)
  (NEXT-COUNT N2 N3) (NEXT-COUNT N3 N4) (NEXT-COUNT N4 N5) (NEXT-COUNT N5 N6)
  (NEXT-COUNT N6 N7) (NEXT-COUNT N7 N8) (NEXT-COUNT N8 N9) (NEXT-COUNT N9 N10)
  (NEXT-COUNT N10 N11) (NEXT-COUNT N11 N12) (NEXT-COUNT N12 N13)
  (NEXT-COUNT N13 N14) (NEXT-COUNT N14 N15) (NEXT-COUNT N15 N16)
  (NEXT-COUNT N16 N17) (NEXT-COUNT N17 N18) (NEXT-COUNT N18 N19)
  (NEXT-COUNT N19 N20) (WAITING O0) (WAITING O1) (WAITING O2) (WAITING O3)
  (WAITING O4) (WAITING O5) (WAITING O6) (WAITING O7) (WAITING O8) (WAITING O9)
  (WAITING O10) (WAITING O11) (WAITING O12) (WAITING O13) (WAITING O14)
  (WAITING O15) (WAITING O16) (WAITING O17) (WAITING O18) (WAITING O19)
  (NOT-MADE P0) (NOT-MADE P1) (NOT-MADE P2) (NOT-MADE P3) (NOT-MADE P4)
  (NOT-MADE P5) (NOT-MADE P6) (NOT-MADE P7) (NOT-MADE P8) (NOT-MADE P9)
  (NOT-MADE P10) (NOT-MADE P11) (NOT-MADE P12) (NOT-MADE P13) (NOT-MADE P14)
  (NOT-MADE P15) (NOT-MADE P16) (NOT-MADE P17) (NOT-MADE P18) (NOT-MADE P19)
  (INCLUDES O0 P13) (REQUIRED-ORDER-NOT-CHECKED O0 P13)
  (REQUIRED-PRODUCT-NOT-CHECKED O0 P13) (INCLUDES O3 P17)
  (REQUIRED-ORDER-NOT-CHECKED O3 P17) (REQUIRED-PRODUCT-NOT-CHECKED O3 P17)
  (INCLUDES O4 P11) (REQUIRED-ORDER-NOT-CHECKED O4 P11)
  (REQUIRED-PRODUCT-NOT-CHECKED O4 P11) (INCLUDES O5 P16)
  (REQUIRED-ORDER-NOT-CHECKED O5 P16) (REQUIRED-PRODUCT-NOT-CHECKED O5 P16)
  (INCLUDES O7 P12) (REQUIRED-ORDER-NOT-CHECKED O7 P12)
  (REQUIRED-PRODUCT-NOT-CHECKED O7 P12) (INCLUDES O9 P18)
  (REQUIRED-ORDER-NOT-CHECKED O9 P18) (REQUIRED-PRODUCT-NOT-CHECKED O9 P18)
  (INCLUDES O10 P15) (REQUIRED-ORDER-NOT-CHECKED O10 P15)
  (REQUIRED-PRODUCT-NOT-CHECKED O10 P15) (INCLUDES O11 P2)
  (REQUIRED-ORDER-NOT-CHECKED O11 P2) (REQUIRED-PRODUCT-NOT-CHECKED O11 P2)
  (INCLUDES O12 P1) (REQUIRED-ORDER-NOT-CHECKED O12 P1)
  (REQUIRED-PRODUCT-NOT-CHECKED O12 P1) (INCLUDES O12 P3)
  (REQUIRED-ORDER-NOT-CHECKED O12 P3) (REQUIRED-PRODUCT-NOT-CHECKED O12 P3)
  (INCLUDES O12 P4) (REQUIRED-ORDER-NOT-CHECKED O12 P4)
  (REQUIRED-PRODUCT-NOT-CHECKED O12 P4) (INCLUDES O12 P9)
  (REQUIRED-ORDER-NOT-CHECKED O12 P9) (REQUIRED-PRODUCT-NOT-CHECKED O12 P9)
  (INCLUDES O12 P14) (REQUIRED-ORDER-NOT-CHECKED O12 P14)
  (REQUIRED-PRODUCT-NOT-CHECKED O12 P14) (INCLUDES O14 P2)
  (REQUIRED-ORDER-NOT-CHECKED O14 P2) (REQUIRED-PRODUCT-NOT-CHECKED O14 P2)
  (INCLUDES O14 P4) (REQUIRED-ORDER-NOT-CHECKED O14 P4)
  (REQUIRED-PRODUCT-NOT-CHECKED O14 P4) (INCLUDES O14 P15)
  (REQUIRED-ORDER-NOT-CHECKED O14 P15) (REQUIRED-PRODUCT-NOT-CHECKED O14 P15)
  (INCLUDES O15 P3) (REQUIRED-ORDER-NOT-CHECKED O15 P3)
  (REQUIRED-PRODUCT-NOT-CHECKED O15 P3) (INCLUDES O15 P15)
  (REQUIRED-ORDER-NOT-CHECKED O15 P15) (REQUIRED-PRODUCT-NOT-CHECKED O15 P15)
  (INCLUDES O16 P12) (REQUIRED-ORDER-NOT-CHECKED O16 P12)
  (REQUIRED-PRODUCT-NOT-CHECKED O16 P12) (INCLUDES O17 P1)
  (REQUIRED-ORDER-NOT-CHECKED O17 P1) (REQUIRED-PRODUCT-NOT-CHECKED O17 P1)
  (INCLUDES O17 P2) (REQUIRED-ORDER-NOT-CHECKED O17 P2)
  (REQUIRED-PRODUCT-NOT-CHECKED O17 P2) (INCLUDES O17 P7)
  (REQUIRED-ORDER-NOT-CHECKED O17 P7) (REQUIRED-PRODUCT-NOT-CHECKED O17 P7)
  (INCLUDES O18 P3) (REQUIRED-ORDER-NOT-CHECKED O18 P3)
  (REQUIRED-PRODUCT-NOT-CHECKED O18 P3) (INCLUDES O18 P6)
  (REQUIRED-ORDER-NOT-CHECKED O18 P6) (REQUIRED-PRODUCT-NOT-CHECKED O18 P6)
  (INCLUDES O18 P16) (REQUIRED-ORDER-NOT-CHECKED O18 P16)
  (REQUIRED-PRODUCT-NOT-CHECKED O18 P16) (INCLUDES O19 P0)
  (REQUIRED-ORDER-NOT-CHECKED O19 P0) (REQUIRED-PRODUCT-NOT-CHECKED O19 P0)
  (HOWMANY-ORDERS-NOT-STARTED P0 N1) (HOWMANY-ORDERS-NOT-STARTED P1 N2)
  (HOWMANY-ORDERS-NOT-STARTED P2 N3) (HOWMANY-ORDERS-NOT-STARTED P3 N3)
  (HOWMANY-ORDERS-NOT-STARTED P4 N2) (HOWMANY-ORDERS-NOT-STARTED P5 N0)
  (HOWMANY-ORDERS-NOT-STARTED P6 N1) (HOWMANY-ORDERS-NOT-STARTED P7 N1)
  (HOWMANY-ORDERS-NOT-STARTED P8 N0) (HOWMANY-ORDERS-NOT-STARTED P9 N1)
  (HOWMANY-ORDERS-NOT-STARTED P10 N0) (HOWMANY-ORDERS-NOT-STARTED P11 N1)
  (HOWMANY-ORDERS-NOT-STARTED P12 N2) (HOWMANY-ORDERS-NOT-STARTED P13 N1)
  (HOWMANY-ORDERS-NOT-STARTED P14 N1) (HOWMANY-ORDERS-NOT-STARTED P15 N3)
  (HOWMANY-ORDERS-NOT-STARTED P16 N2) (HOWMANY-ORDERS-NOT-STARTED P17 N1)
  (HOWMANY-ORDERS-NOT-STARTED P18 N1) (HOWMANY-ORDERS-NOT-STARTED P19 N0)
  (HOWMANY-PRODUCTS-NOT-MADE O0 N1) (HOWMANY-PRODUCTS-NOT-MADE O1 N0)
  (HOWMANY-PRODUCTS-NOT-MADE O2 N0) (HOWMANY-PRODUCTS-NOT-MADE O3 N1)
  (HOWMANY-PRODUCTS-NOT-MADE O4 N1) (HOWMANY-PRODUCTS-NOT-MADE O5 N1)
  (HOWMANY-PRODUCTS-NOT-MADE O6 N0) (HOWMANY-PRODUCTS-NOT-MADE O7 N1)
  (HOWMANY-PRODUCTS-NOT-MADE O8 N0) (HOWMANY-PRODUCTS-NOT-MADE O9 N1)
  (HOWMANY-PRODUCTS-NOT-MADE O10 N1) (HOWMANY-PRODUCTS-NOT-MADE O11 N1)
  (HOWMANY-PRODUCTS-NOT-MADE O12 N5) (HOWMANY-PRODUCTS-NOT-MADE O13 N0)
  (HOWMANY-PRODUCTS-NOT-MADE O14 N3) (HOWMANY-PRODUCTS-NOT-MADE O15 N2)
  (HOWMANY-PRODUCTS-NOT-MADE O16 N1) (HOWMANY-PRODUCTS-NOT-MADE O17 N3)
  (HOWMANY-PRODUCTS-NOT-MADE O18 N3) (HOWMANY-PRODUCTS-NOT-MADE O19 N1)
  (= (TOTAL-COST) 0))
 (:GOAL
  (AND (SHIPPED O0) (SHIPPED O1) (SHIPPED O2) (SHIPPED O3) (SHIPPED O4)
       (SHIPPED O5) (SHIPPED O6) (SHIPPED O7) (SHIPPED O8) (SHIPPED O9)
       (SHIPPED O10) (SHIPPED O11) (SHIPPED O12) (SHIPPED O13) (SHIPPED O14)
       (SHIPPED O15) (SHIPPED O16) (SHIPPED O17) (SHIPPED O18) (SHIPPED O19)))
 (:METRIC MINIMIZE (TOTAL-COST)))

; plan
1. (open-new-stack n0 n1)
   deleted: (stacks-avail n0)
   added: (stacks-avail n1)
   goals met: 0 of 20
2. (start-order o1 n1 n0)
   deleted: (waiting o1) (stacks-avail n1)
   added: (started o1) (stacks-avail n0)
   goals met: 0 of 20
3. (ship-order n0 n1 o1)
   deleted: (started o1) (stacks-avail n0)
   added: (shipped o1) (stacks-avail n1)
   goals met: 1 of 20
4. (start-order o13 n1 n0)
   deleted: (waiting o13) (stacks-avail n1)
   added: (started o13) (stacks-avail n0)
   goals met: 1 of 20
5. (ship-order n0 n1 o13)
   deleted: (started o13) (stacks-avail n0)
   added: (shipped o13) (stacks-avail n1)
   goals met: 2 of 20
6. (start-order o2 n1 n0)
   deleted: (waiting o2) (stacks-avail n1)
   added: (started o2) (stacks-avail n0)
   goals met: 2 of 20
7. (ship-order n0 n1 o2)
   deleted: (started o2) (stacks-avail n0)
   added: (shipped o2) (stacks-avail n1)
   goals met: 3 of 20
8. (start-order o6 n1 n0)
   deleted: (waiting o6) (stacks-avail n1)
   added: (started o6) (stacks-avail n0)
   goals met: 3 of 20
9. (ship-order n0 n1 o6)
   deleted: (started o6) (stacks-avail n0)
   added: (shipped o6) (stacks-avail n1)
   goals met: 4 of 20
10. (start-order o8 n1 n0)
   deleted: (waiting o8) (stacks-avail n1)
   added: (started o8) (stacks-avail n0)
   goals met: 4 of 20
11. (ship-order n0 n1 o8)
   deleted: (started o8) (stacks-avail n0)
   added: (shipped o8) (stacks-avail n1)
   goals met: 5 of 20
12. (start-order o0 n1 n0)
   deleted: (waiting o0) (stacks-avail n1)
   added: (started o0) (stacks-avail n0)
   goals met: 5 of 20
13. (check-remaining-order o0 p13 n1 n0)
   deleted: (howmany-orders-not-started p13 n1) (required-order-not-checked o0 p13)
   added: (howmany-orders-not-started p13 n0)
   goals met: 5 of 20
14. (make-product p13)
   deleted: (not-made p13)
   added: (made p13)
   goals met: 5 of 20
15. (check-remaining-product o0 p13 n1 n0)
   deleted: (howmany-products-not-made o0 n1) (required-product-not-checked o0 p13)
   added: (howmany-products-not-made o0 n0)
   goals met: 5 of 20
16. (ship-order n0 n1 o0)
   deleted: (started o0) (stacks-avail n0)
   added: (shipped o0) (stacks-avail n1)
   goals met: 6 of 20
17. (start-order o15 n1 n0)
   deleted: (waiting o15) (stacks-avail n1)
   added: (started o15) (stacks-avail n0)
   goals met: 6 of 20
18. (check-remaining-order o15 p15 n3 n2)
   deleted: (howmany-orders-not-started p15 n3) (required-order-not-checked o15 p15)
   added: (howmany-orders-not-started p15 n2)
   goals met: 6 of 20
19. (open-new-stack n0 n1)
   deleted: (stacks-avail n0)
   added: (stacks-avail n1)
   goals met: 6 of 20
20. (start-order o14 n1 n0)
   deleted: (waiting o14) (stacks-avail n1)
   added: (started o14) (stacks-avail n0)
   goals met: 6 of 20
21. (check-remaining-order o14 p15 n2 n1)
   deleted: (howmany-orders-not-started p15 n2) (required-order-not-checked o14 p15)
   added: (howmany-orders-not-started p15 n1)
   goals met: 6 of 20
22. (check-remaining-order o14 p2 n3 n2)
   deleted: (howmany-orders-not-started p2 n3) (required-order-not-checked o14 p2)
   added: (howmany-orders-not-started p2 n2)
   goals met: 6 of 20
23. (check-remaining-order o14 p4 n2 n1)
   deleted: (howmany-orders-not-started p4 n2) (required-order-not-checked o14 p4)
   added: (howmany-orders-not-started p4 n1)
   goals met: 6 of 20
24. (open-new-stack n0 n1)
   deleted: (stacks-avail n0)
   added: (stacks-avail n1)
   goals met: 6 of 20
25. (start-order o10 n1 n0)
   deleted: (waiting o10) (stacks-avail n1)
   added: (started o10) (stacks-avail n0)
   goals met: 6 of 20
26. (check-remaining-order o10 p15 n1 n0)
   deleted: (howmany-orders-not-started p15 n1) (required-order-not-checked o10 p15)
   added: (howmany-orders-not-started p15 n0)
   goals met: 6 of 20
27. (make-product p15)
   deleted: (not-made p15)
   added: (made p15)
   goals met: 6 of 20
28. (check-remaining-product o10 p15 n1 n0)
   deleted: (howmany-products-not-made o10 n1) (required-product-not-checked o10 p15)
   added: (howmany-products-not-made o10 n0)
   goals met: 6 of 20
29. (ship-order n0 n1 o10)
   deleted: (started o10) (stacks-avail n0)
   added: (shipped o10) (stacks-avail n1)
   goals met: 7 of 20
30. (start-order o11 n1 n0)
   deleted: (waiting o11) (stacks-avail n1)
   added: (started o11) (stacks-avail n0)
   goals met: 7 of 20
31. (check-remaining-order o11 p2 n2 n1)
   deleted: (howmany-orders-not-started p2 n2) (required-order-not-checked o11 p2)
   added: (howmany-orders-not-started p2 n1)
   goals met: 7 of 20
32. (check-remaining-product o14 p15 n3 n2)
   deleted: (howmany-products-not-made o14 n3) (required-product-not-checked o14 p15)
   added: (howmany-products-not-made o14 n2)
   goals met: 7 of 20
33. (open-new-stack n0 n1)
   deleted: (stacks-avail n0)
   added: (stacks-avail n1)
   goals met: 7 of 20
34. (start-order o19 n1 n0)
   deleted: (waiting o19) (stacks-avail n1)
   added: (started o19) (stacks-avail n0)
   goals met: 7 of 20
35. (check-remaining-product o15 p15 n2 n1)
   deleted: (howmany-products-not-made o15 n2) (required-product-not-checked o15 p15)
   added: (howmany-products-not-made o15 n1)
   goals met: 7 of 20
36. (check-remaining-order o19 p0 n1 n0)
   deleted: (howmany-orders-not-started p0 n1) (required-order-not-checked o19 p0)
   added: (howmany-orders-not-started p0 n0)
   goals met: 7 of 20
37. (make-product p0)
   deleted: (not-made p0)
   added: (made p0)
   goals met: 7 of 20
38. (check-remaining-product o19 p0 n1 n0)
   deleted: (howmany-products-not-made o19 n1) (required-product-not-checked o19 p0)
   added: (howmany-products-not-made o19 n0)
   goals met: 7 of 20
39. (ship-order n0 n1 o19)
   deleted: (started o19) (stacks-avail n0)
   added: (shipped o19) (stacks-avail n1)
   goals met: 8 of 20
40. (start-order o17 n1 n0)
   deleted: (waiting o17) (stacks-avail n1)
   added: (started o17) (stacks-avail n0)
   goals met: 8 of 20
41. (check-remaining-order o17 p2 n1 n0)
   deleted: (howmany-orders-not-started p2 n1) (required-order-not-checked o17 p2)
   added: (howmany-orders-not-started p2 n0)
   goals met: 8 of 20
42. (make-product p2)
   deleted: (not-made p2)
   added: (made p2)
   goals met: 8 of 20
43. (check-remaining-product o11 p2 n1 n0)
   deleted: (howmany-products-not-made o11 n1) (required-product-not-checked o11 p2)
   added: (howmany-products-not-made o11 n0)
   goals met: 8 of 20
44. (ship-order n0 n1 o11)
   deleted: (started o11) (stacks-avail n0)
   added: (shipped o11) (stacks-avail n1)
   goals met: 9 of 20
45. (start-order o12 n1 n0)
   deleted: (waiting o12) (stacks-avail n1)
   added: (started o12) (stacks-avail n0)
   goals met: 9 of 20
46. (check-remaining-order o12 p14 n1 n0)
   deleted: (howmany-orders-not-started p14 n1) (required-order-not-checked o12 p14)
   added: (howmany-orders-not-started p14 n0)
   goals met: 9 of 20
47. (make-product p14)
   deleted: (not-made p14)
   added: (made p14)
   goals met: 9 of 20
48. (check-remaining-product o12 p14 n5 n4)
   deleted: (howmany-products-not-made o12 n5) (required-product-not-checked o12 p14)
   added: (howmany-products-not-made o12 n4)
   goals met: 9 of 20
49. (check-remaining-product o14 p2 n2 n1)
   deleted: (howmany-products-not-made o14 n2) (required-product-not-checked o14 p2)
   added: (howmany-products-not-made o14 n1)
   goals met: 9 of 20
50. (check-remaining-order o12 p4 n1 n0)
   deleted: (howmany-orders-not-started p4 n1) (required-order-not-checked o12 p4)
   added: (howmany-orders-not-started p4 n0)
   goals met: 9 of 20
51. (make-product p4)
   deleted: (not-made p4)
   added: (made p4)
   goals met: 9 of 20
52. (check-remaining-product o14 p4 n1 n0)
   deleted: (howmany-products-not-made o14 n1) (required-product-not-checked o14 p4)
   added: (howmany-products-not-made o14 n0)
   goals met: 9 of 20
53. (check-remaining-product o12 p4 n4 n3)
   deleted: (howmany-products-not-made o12 n4) (required-product-not-checked o12 p4)
   added: (howmany-products-not-made o12 n3)
   goals met: 9 of 20
54. (ship-order n0 n1 o14)
   deleted: (started o14) (stacks-avail n0)
   added: (shipped o14) (stacks-avail n1)
   goals met: 10 of 20
55. (start-order o7 n1 n0)
   deleted: (waiting o7) (stacks-avail n1)
   added: (started o7) (stacks-avail n0)
   goals met: 10 of 20
56. (check-remaining-order o7 p12 n2 n1)
   deleted: (howmany-orders-not-started p12 n2) (required-order-not-checked o7 p12)
   added: (howmany-orders-not-started p12 n1)
   goals met: 10 of 20
57. (check-remaining-product o17 p2 n3 n2)
   deleted: (howmany-products-not-made o17 n3) (required-product-not-checked o17 p2)
   added: (howmany-products-not-made o17 n2)
   goals met: 10 of 20
58. (check-remaining-order o12 p9 n1 n0)
   deleted: (howmany-orders-not-started p9 n1) (required-order-not-checked o12 p9)
   added: (howmany-orders-not-started p9 n0)
   goals met: 10 of 20
59. (make-product p9)
   deleted: (not-made p9)
   added: (made p9)
   goals met: 10 of 20
60. (check-remaining-product o12 p9 n3 n2)
   deleted: (howmany-products-not-made o12 n3) (required-product-not-checked o12 p9)
   added: (howmany-products-not-made o12 n2)
   goals met: 10 of 20
61. (check-remaining-order o17 p1 n2 n1)
   deleted: (howmany-orders-not-started p1 n2) (required-order-not-checked o17 p1)
   added: (howmany-orders-not-started p1 n1)
   goals met: 10 of 20
62. (check-remaining-order o12 p1 n1 n0)
   deleted: (howmany-orders-not-started p1 n1) (required-order-not-checked o12 p1)
   added: (howmany-orders-not-started p1 n0)
   goals met: 10 of 20
63. (make-product p1)
   deleted: (not-made p1)
   added: (made p1)
   goals met: 10 of 20
64. (check-remaining-product o12 p1 n2 n1)
   deleted: (howmany-products-not-made o12 n2) (required-product-not-checked o12 p1)
   added: (howmany-products-not-made o12 n1)
   goals met: 10 of 20
65. (check-remaining-order o12 p3 n3 n2)
   deleted: (howmany-orders-not-started p3 n3) (required-order-not-checked o12 p3)
   added: (howmany-orders-not-started p3 n2)
   goals met: 10 of 20
66. (check-remaining-order o15 p3 n2 n1)
   deleted: (howmany-orders-not-started p3 n2) (required-order-not-checked o15 p3)
   added: (howmany-orders-not-started p3 n1)
   goals met: 10 of 20
67. (check-remaining-product o17 p1 n2 n1)
   deleted: (howmany-products-not-made o17 n2) (required-product-not-checked o17 p1)
   added: (howmany-products-not-made o17 n1)
   goals met: 10 of 20
68. (check-remaining-order o17 p7 n1 n0)
   deleted: (howmany-orders-not-started p7 n1) (required-order-not-checked o17 p7)
   added: (howmany-orders-not-started p7 n0)
   goals met: 10 of 20
69. (make-product p7)
   deleted: (not-made p7)
   added: (made p7)
   goals met: 10 of 20
70. (check-remaining-product o17 p7 n1 n0)
   deleted: (howmany-products-not-made o17 n1) (required-product-not-checked o17 p7)
   added: (howmany-products-not-made o17 n0)
   goals met: 10 of 20
71. (ship-order n0 n1 o17)
   deleted: (started o17) (stacks-avail n0)
   added: (shipped o17) (stacks-avail n1)
   goals met: 11 of 20
72. (start-order o18 n1 n0)
   deleted: (waiting o18) (stacks-avail n1)
   added: (started o18) (stacks-avail n0)
   goals met: 11 of 20
73. (check-remaining-order o18 p16 n2 n1)
   deleted: (howmany-orders-not-started p16 n2) (required-order-not-checked o18 p16)
   added: (howmany-orders-not-started p16 n1)
   goals met: 11 of 20
74. (check-remaining-order o18 p3 n1 n0)
   deleted: (howmany-orders-not-started p3 n1) (required-order-not-checked o18 p3)
   added: (howmany-orders-not-started p3 n0)
   goals met: 11 of 20
75. (make-product p3)
   deleted: (not-made p3)
   added: (made p3)
   goals met: 11 of 20
76. (check-remaining-product o12 p3 n1 n0)
   deleted: (howmany-products-not-made o12 n1) (required-product-not-checked o12 p3)
   added: (howmany-products-not-made o12 n0)
   goals met: 11 of 20
77. (ship-order n0 n1 o12)
   deleted: (started o12) (stacks-avail n0)
   added: (shipped o12) (stacks-avail n1)
   goals met: 12 of 20
78. (check-remaining-product o15 p3 n1 n0)
   deleted: (howmany-products-not-made o15 n1) (required-product-not-checked o15 p3)
   added: (howmany-products-not-made o15 n0)
   goals met: 12 of 20
79. (ship-order n1 n2 o15)
   deleted: (started o15) (stacks-avail n1)
   added: (shipped o15) (stacks-avail n2)
   goals met: 13 of 20
80. (start-order o16 n2 n1)
   deleted: (waiting o16) (stacks-avail n2)
   added: (started o16) (stacks-avail n1)
   goals met: 13 of 20
81. (check-remaining-order o16 p12 n1 n0)
   deleted: (howmany-orders-not-started p12 n1) (required-order-not-checked o16 p12)
   added: (howmany-orders-not-started p12 n0)
   goals met: 13 of 20
82. (make-product p12)
   deleted: (not-made p12)
   added: (made p12)
   goals met: 13 of 20
83. (check-remaining-product o16 p12 n1 n0)
   deleted: (howmany-products-not-made o16 n1) (required-product-not-checked o16 p12)
   added: (howmany-products-not-made o16 n0)
   goals met: 13 of 20
84. (ship-order n1 n2 o16)
   deleted: (started o16) (stacks-avail n1)
   added: (shipped o16) (stacks-avail n2)
   goals met: 14 of 20
85. (check-remaining-product o18 p3 n3 n2)
   deleted: (howmany-products-not-made o18 n3) (required-product-not-checked o18 p3)
   added: (howmany-products-not-made o18 n2)
   goals met: 14 of 20
86. (start-order o3 n2 n1)
   deleted: (waiting o3) (stacks-avail n2)
   added: (started o3) (stacks-avail n1)
   goals met: 14 of 20
87. (check-remaining-order o3 p17 n1 n0)
   deleted: (howmany-orders-not-started p17 n1) (required-order-not-checked o3 p17)
   added: (howmany-orders-not-started p17 n0)
   goals met: 14 of 20
88. (make-product p17)
   deleted: (not-made p17)
   added: (made p17)
   goals met: 14 of 20
89. (check-remaining-product o3 p17 n1 n0)
   deleted: (howmany-products-not-made o3 n1) (required-product-not-checked o3 p17)
   added: (howmany-products-not-made o3 n0)
   goals met: 14 of 20
90. (ship-order n1 n2 o3)
   deleted: (started o3) (stacks-avail n1)
   added: (shipped o3) (stacks-avail n2)
   goals met: 15 of 20
91. (start-order o4 n2 n1)
   deleted: (waiting o4) (stacks-avail n2)
   added: (started o4) (stacks-avail n1)
   goals met: 15 of 20
92. (check-remaining-order o4 p11 n1 n0)
   deleted: (howmany-orders-not-started p11 n1) (required-order-not-checked o4 p11)
   added: (howmany-orders-not-started p11 n0)
   goals met: 15 of 20
93. (make-product p11)
   deleted: (not-made p11)
   added: (made p11)
   goals met: 15 of 20
94. (check-remaining-product o4 p11 n1 n0)
   deleted: (howmany-products-not-made o4 n1) (required-product-not-checked o4 p11)
   added: (howmany-products-not-made o4 n0)
   goals met: 15 of 20
95. (ship-order n1 n2 o4)
   deleted: (started o4) (stacks-avail n1)
   added: (shipped o4) (stacks-avail n2)
   goals met: 16 of 20
96. (start-order o5 n2 n1)
   deleted: (waiting o5) (stacks-avail n2)
   added: (started o5) (stacks-avail n1)
   goals met: 16 of 20
97. (check-remaining-order o5 p16 n1 n0)
   deleted: (howmany-orders-not-started p16 n1) (required-order-not-checked o5 p16)
   added: (howmany-orders-not-started p16 n0)
   goals met: 16 of 20
98. (make-product p16)
   deleted: (not-made p16)
   added: (made p16)
   goals met: 16 of 20
99. (check-remaining-product o18 p16 n2 n1)
   deleted: (howmany-products-not-made o18 n2) (required-product-not-checked o18 p16)
   added: (howmany-products-not-made o18 n1)
   goals met: 16 of 20
100. (check-remaining-product o5 p16 n1 n0)
   deleted: (howmany-products-not-made o5 n1) (required-product-not-checked o5 p16)
   added: (howmany-products-not-made o5 n0)
   goals met: 16 of 20
101. (ship-order n1 n2 o5)
   deleted: (started o5) (stacks-avail n1)
   added: (shipped o5) (stacks-avail n2)
   goals met: 17 of 20
102. (check-remaining-product o7 p12 n1 n0)
   deleted: (howmany-products-not-made o7 n1) (required-product-not-checked o7 p12)
   added: (howmany-products-not-made o7 n0)
   goals met: 17 of 20
103. (ship-order n2 n3 o7)
   deleted: (started o7) (stacks-avail n2)
   added: (shipped o7) (stacks-avail n3)
   goals met: 18 of 20
104. (start-order o9 n3 n2)
   deleted: (waiting o9) (stacks-avail n3)
   added: (started o9) (stacks-avail n2)
   goals met: 18 of 20
105. (check-remaining-order o9 p18 n1 n0)
   deleted: (howmany-orders-not-started p18 n1) (required-order-not-checked o9 p18)
   added: (howmany-orders-not-started p18 n0)
   goals met: 18 of 20
106. (make-product p18)
   deleted: (not-made p18)
   added: (made p18)
   goals met: 18 of 20
107. (check-remaining-product o9 p18 n1 n0)
   deleted: (howmany-products-not-made o9 n1) (required-product-not-checked o9 p18)
   added: (howmany-products-not-made o9 n0)
   goals met: 18 of 20
108. (ship-order n2 n3 o9)
   deleted: (started o9) (stacks-avail n2)
   added: (shipped o9) (stacks-avail n3)
   goals met: 19 of 20
109. (check-remaining-order o18 p6 n1 n0)
   deleted: (howmany-orders-not-started p6 n1) (required-order-not-checked o18 p6)
   added: (howmany-orders-not-started p6 n0)
   goals met: 19 of 20
110. (make-product p6)
   deleted: (not-made p6)
   added: (made p6)
   goals met: 19 of 20
111. (check-remaining-product o18 p6 n1 n0)
   deleted: (howmany-products-not-made o18 n1) (required-product-not-checked o18 p6)
   added: (howmany-products-not-made o18 n0)
   goals met: 19 of 20
112. (ship-order n3 n4 o18)
   deleted: (started o18) (stacks-avail n3)
   added: (shipped o18) (stacks-avail n4)
   goals met: 20 of 20
